/**
 * @author junlin.yan
 * @date 2018/8/24
 * @description Test file template
 */

// 词汇
const vocab = {
  '203017001': '中译英', // 2030015
  '203017002': '英译中', // 2030011
  '203017000': '单词拼写', // 2031023
  '203017005': '例句跟读', // 2030048
  '203017003': '单词跟读', // 2030047
  '203017009': '词汇造句' // 2031024
};
// 句型
const sentence = {
  '203017006': '句子跟读',  // 2031027
  '203017004': '句子拼写',  // 2031025
  '203017008': '情景对话' // 2031026
};

// 课文跟读
const listen = {
  '203017007': '逐句跟读',  // 2030035
  '203017010': '段落朗读' // 2030069
};

// 口语
const oral = {
  '203016000': '短文朗读',
  '203016001': '听选信息',
  '203016002': '回答问题',
  '203016003': '信息转述',
  '203016004': '询问信息',
  '203016005': '情景对话',
  '203016006': '情景反应',
  '203016007': '情景问答',
  '203016008': '口头表达',
  '203016009': '听后记录并转述',
  '203016010': '读单词',
  '203016011': '读句子',
};

export default {
  'vocab': Object.keys(vocab),
  'listen': Object.keys(listen),
  'sentence': Object.keys(sentence),
  'oral': Object.keys(oral)
}
